import {Link} from "react-router-dom";

const WelcomePage = () => {
    return (
        <div>
            <p>
                Присоединяйтесь к событиям, вечиринкам или поездкам.
                Проводите время в веселой компании, отдыхайте и планируйте события
                вместе с Itinera
            </p>

            <div>
                <p>
                    Создайте аккаунт в Itinera прямо сейчас и
                    начните свое путишествие вместе с нами
                </p>
                <Link to="/auth/register">Регистрация</Link>
            </div>

            <div>
                <p>
                    Хотите иметь представление как устроена Itinera?
                    Мы предоставляем возможность нашим пользователям изучить
                    интерфейс перед тем как они зарегестрируются, для того чтобы
                    у них была полная картина того с чем они работают
                </p>
                <Link to="/explore">Исследовать</Link>
            </div>

            <div>
                <h1>О нас</h1>
                <p>
                    Itinera - начинающая компания которая помогает людям грамотно,
                    удобно и быстро планировать все свои намечающиеся события.
                    Начиная от обычных дружеских походов, заканчивая целыми
                    мероприятиями для сотен, а то и тысяч человек
                </p>
            </div>
        </div>
    )
}

export default WelcomePage;